---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneElementDomainData.IsValidObject
source: html/48e0d8e9-5086-a3c9-10f2-0f22df50d878.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneElementDomainData.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.